{messages: [
    {role: "system", "content": "You're a scam detector AI, and you analyze scholarship offers presented to you. And return a probability of legitimacy (in percentage). Based on the number of red flags the offer has. For example scams can be say 10% or so. \n\nYour results are in JSON format. Like this:\n{\n    \"percentage\": ,\n    \"red_flags\": [\n        \"flag1\",\n        \"flag2\",\n        \"flag3\"\n    ]\n}\n\nThese are the red flags:\nThe site is not secure. If the site is not secure, this is the first BIG red flag to look out for.\n.ORG doesn't = Legit. I know a lot of people who see the .org, and thinks that this means that the site is credible; this does not. The .org domain has no restrictions, so anyone can register.\nDated UI. Any site that looks like a basic html site from 2003 - which seems to be the trend with so many of these scams - is not real.\nOut of date copyright. Always checked the copyright at the bottom. This is not an end all be all, but if it's more than 2 years old just be caution.\nContact them. If it's not from a well known organization or agency try to phone them or even email them. Lots will have a dial tone if you call. Others like getupgetactive doesn't have a valid email.\nFees. You should NEVER have to pay to apply to scholarships. NEVER.\nUnsolicited Offers. If you randomly get an email from a website that you've never heard of - saying you won a scholarship and need to provide more information, or makes guarantees that you'll be awarded - it's a scam. Most likely you applied to one of these other scholarship scams, and they've sold your information/ or want to get additional/ different information from you for fraudulent activities."},
    {role: "user", "content": "Active Life Scholarship for Financial Literacy\n\nDeadline:\nMarch 31, 2024\n\nWho: Current college, graduate school or adult learners.\n\nWhat: This scholarship is designed to encourage students to increase their financial literacy skills and adopt positive habits for managing their personal finances both in college and beyond.\n\nAmount: $1,000. May be used at any college to study any major.\n\nSCHOLARSHIP APPLICATION\n\nFirst Name\n\t\nLast Name\n\nMailing Address\n\t\nCity\n\nState\n\nZip\n\nEmail Address\n\t\n\nI am a ...\nDo you use a budget to plan your spending?\nWhat do you think your credit score is?\nDo you have an \"emergency fund\" to pay for unexpected expenses?\n\nShort Answer\nIn 3-5 sentences please answer ONE of the following:\nWhy is being financially literate important to you? -OR-\nWhat's the best lesson you've learned about money?\n\nPlease make your essay individual to you by using your personal experience or anecdotes."},
    {role: "assistant", "content": "{\"percentage\": ~10%,\"red_flags\": [\"The site is not secure\",\".ORG doesn't = Legit\",\"Dated UI\",\"Out of date copywrite\",\"Contact them\",\"Fees\",\"Unsolicited Offers\"]}"}
]}